# yolov5/models/mobile-yolo5s_voc.yaml

nc: 31

depth_multiple: 0.33
width_multiple: 0.50

anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]

backbone:
  [[-1, 1, Conv, [3, 32, 3, 2]],                      # Downsample
   [-1, 1, MobileNetV2_Backbone, [3, 80]],
   [-1, 1, SPPF, [64, 5]],
   [-1, 1, Conv, [128, 3, 2]],                        # Downsample
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 3, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 1, C3, [512]]]

head:
  [[-1, 1, SPPF, [512]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, C3, [256]],
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 14], 1, Concat, [1]],
   [-1, 3, C3, [256]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 10], 1, Concat, [1]],
   [-1, 3, C3, [512]],
   [[17, 20, 23], 1, Detect, [31, anchors]]]  # ✅ updated nc to 31
